# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

print('Введите число для конвертации: ')
n = int(input())
print(bin(n)[2:])
